-- Вставка даних до таблиці Description
INSERT INTO Description (name, description)
VALUES
    ('Період Суґа', 'Період історії Японії від 1333 до 1573 року, що охоплює панування клану Асікага.'),
    ('Епоха Асікага', 'Період японської історії з 1336 по 1573 рік, під час якого владу здійснював клан Асікага.'),
    ('Епоха Сейдзігахари', 'Період історії Японії з 1603 по 1868 рік, що відзначався децентралізацією влади і епохою внутрішньої стабільності.'),
    ('Тайська криза', 'Дипломатичний криза між Таїландом та Францією та Великобританією у 1893 році.'),
    ('Повстання сябаші', 'Соціальне повстання в Японії у 1877 році проти модернізаційних реформ уряду Мейдзі.'),
    ('Вибух японсько-китайської війни', 'Початок війни між Японією та Китаєм у 1937 році, що призвів до Другої світової війни в Тихоокеанському басейні.'),
    ('Період Едо', 'Період історії Японії з 1603 по 1868 рік, коли країна була під владою Токугава.'),
    ('Мейдзі-реставрація', 'Період історії Японії з 1868 по 1912 рік, що відзначався відновленням імперії після кінця періоду Едо.'),
    ('Імперія Рангаку', 'Період в історії Японії з 1603 по 1868 рік, коли країна здійснювала активний обмін технологіями з Європою.'),
    ('Епоха Хейан', 'Період з 794 по 1185 рік в історії Японії, який відзначався піднесенням впливу буддизму та зростанням влади знаті.'),
    ('Епоха Камакура', 'Період з 1185 по 1333 рік в історії Японії, коли владу в країні мали шогуни з клану Мінамото.'),
    ('Епоха Мура Момояма', 'Період з 1573 по 1603 рік в історії Японії, що передував формуванню періоду Едо.'),
    ('Епоха Хейан', 'Період з 794 по 1185 рік в історії Японії, який відзначався піднесенням впливу буддизму та зростанням влади знаті.'),
    ('Епоха Тайко', 'Період з 645 по 710 рік в історії Японії, коли країна була утворена в єдину державу.'),
    ('Епоха Нара', 'Період з 710 по 794 рік в історії Японії, коли країна переживала період культурного розквіту.');

-- Вставка даних до таблиці Person
INSERT INTO Person (name, address)
VALUES
    ('Ісіда Сястаро', 'Токіо, Японія'),
    ('Мацудайра Шоґоро', 'Осака, Японія'),
    ('Каваі Синґоро', 'Кіото, Японія'),
    ('Накамура Юкі', 'Фукуока, Японія'),
    ('Судзукі Айко', 'Нагоя, Японія'),
    ('Танака Хіросі', 'Саппоро, Японія'),
    ('Іванов Іван', 'Москва, Росія'),
    ('Петров Петро', 'Санкт-Петербург, Росія'),
    ('Хуан Чжі', 'Пекін, Китай'),
    ('Чжоу Ван', 'Шанхай, Китай'),
    ('Лі Мін', 'Гуанчжоу, Китай'),
    ('Кім Чен Ір', 'Пхеньян, Північна Корея'),
    ('Мун Чже Ін', 'Сеул, Південна Корея'),
    ('Джон Сміт', 'Нью-Йорк, США');

-- Вставка даних до таблиці Events
INSERT INTO Events (name, description)
VALUES
    ('Битва при Нагахамі', 'Битва, яка відбулася в 1575 році під час періоду Суґа, між військами Ода Нобунаги та Такеда Сінґена.'),
    ('Битва при Секіґахарі', 'Битва при Секіґахарі у 1600 році зробила Токугаву Ієясу сильним правителем Японії.'),
    ('Відкриття Японії для Заходу', 'Політична та торгова зміна політики Японії у 1853 році, яка призвела до відкриття країни для зовнішнього світу.'),
    ('Бомбардування Хіросіми та Нагасакі', 'Ядерні бомбардування Хіросіми та Нагасакі в 1945 році завершили Другу світову війну.'),
    ('Виверження вулкану Фудзі', 'Масштабне виверження вулкану Фудзі у 1707 році, що призвело до змін в ландшафті та кліматі Японії.'),
    ('Конфлікт в Чжаосі', 'Війна в Китаї між китайськими військами та японськими окупаційними силами під час другої китайсько-японської війни.'),
    ('Окупація Тайваню', 'Приєднання острова Тайвань до Японії у 1895 році після перемоги в китайсько-японській війні.'),
    ('Битва за Пеліліу', 'Битва у Тихому океані під час Другої світової війни, що відбулася на острові Пеліліу між японськими та американськими силами.'),
    ('Корейська війна', 'Війна між Північною та Південною Кореєю з 1950 по 1953 рік, у якій брали участь також США, Китай та ООН.'),
    ('Бомбардування Кобе', 'Масштабне бомбардування міста Кобе в Японії союзницькими силами під час Другої світової війни.'),
    ('Великий землетрус у Канто', 'Землетрус у регіоні Канто в Японії 1923 року, що призвів до значних руйнувань та втрат.'),
    ('Бітва за Сайпан', 'Битва між США та Японією під час Другої світової війни за контроль над островом Сайпан в Тихому океані.'),
    ('Січуансько-Японська війна', 'Конфлікт між Китаєм та Японією у 1938–1945 роках під час Другої китайсько-японської війни.'),
    ('Битва за Окінаву', 'Одна з найбільших битв Другої світової війни, яка відбулася на острові Окінава в 1945 році між США та Японією.'),
    ('Японсько-російська війна', 'Війна між Японією та Російською імперією в 1904–1905 роках, що завершилася поразкою Росії.');

-- Вставка даних до таблиці users
INSERT INTO users (login, password, role, name)
VALUES
    ('asd', 'asd', 'admin', 'Адміністратор'),
    ('manager', 'manager123', 'moder', 'Марія Сидорова'),
    ('client1', 'client123', 'client', 'Іван Петров');

-- Вставка даних до таблиці Client
INSERT INTO Client (name, description_id)
VALUES
    ('Клієнт 1', (SELECT id FROM Description WHERE name = 'Тайська криза')),
    ('Клієнт 2', (SELECT id FROM Description WHERE name = 'Повстання сябаші'));
