-- Вставка даних до таблиці Description
INSERT INTO Description (name, description)
VALUES
    ('Період Суґа', 'Період історії Японії від 1333 до 1573 року, що охоплює панування клану Асікага.'),
    ('Епоха Асікага', 'Період японської історії з 1336 по 1573 рік, під час якого владу здійснював клан Асікага.'),
    ('Епоха Сейдзігахари', 'Період історії Японії з 1603 по 1868 рік, що відзначався децентралізацією влади і епохою внутрішньої стабільності.');

-- Вставка даних до таблиці Person
INSERT INTO Person (name, address)
VALUES
    ('Ісіда Сястаро', 'Токіо, Японія'),
    ('Мацудайра Шоґоро', 'Осака, Японія'),
    ('Каваі Синґоро', 'Кіото, Японія');

-- Вставка даних до таблиці Events
INSERT INTO Events (name, description)
VALUES
    ('Битва при Нагахамі', 'Битва, яка відбулася в 1575 році під час періоду Суґа, між військами Ода Нобунаги та Такеда Сінґена.'),
    ('Битва при Секіґахарі', 'Вирішальна битва в період Сейдзігахарі, яка відбулася в 1600 році і в результаті якої Токугава Ієясу став сильним правителем Японії.'),
    ('Відкриття Японії для Заходу', 'Політична та торгова зміна політики Японії у 1853 році, яка призвела до відкриття країни для зовнішнього світу.');

-- Вставка даних до таблиці users
INSERT INTO users (login, password, role, name)
VALUES
    ('admin', 'admin123', 'admin', 'Адміністратор'),
    ('manager', 'manager123', 'moder', 'Марія Сидорова'),
    ('client1', 'client123', 'client', 'Іван Петров');

-- Вставка даних до таблиці Client
INSERT INTO Client (name, description_id)
VALUES
    ('Клієнт 1', (SELECT id FROM Description WHERE name = 'Тайська криза')),
    ('Клієнт 2', (SELECT id FROM Description WHERE name = 'Повстання сябаші'));
